tutorials/TC3ForeBody_TwoPhase_theta0.014D2.5/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     hy2LPTFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.016;//0.014;

deltaT          1.0e-10;

writeControl    adjustableRunTime;

writeInterval   1.0e-5;

purgeWrite      10;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.7;

maxDeltaT       1.0e-5;

evolveParticles   true;

libs ("libstrathFiniteVolume.so");

functions
{
    //#include "forces"
    
    //#include "surfaceQuantities"
}


// ************************************************************************* //
