tutorials/TC3ForeBody_TwoPhase_theta0.014D2.5/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "2e-10/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          260;
        startFace       31399;
    }
    outlet
    {
        type            patch;
        nFaces          61;
        startFace       31659;
    }
    object
    {
        type            wall;
        nFaces          260;
        startFace       31720;
    }
    empty
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       31980;
    }
    frontAndBack
    {
        type            empty;
        nFaces          0;
        startFace       31980;
    }
    frontAndBack_pos
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          15860;
        startFace       31980;
    }
    frontAndBack_neg
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          15860;
        startFace       47840;
    }
)

// ************************************************************************* //
