tutorials/TC3ForeBody_TwoPhase_theta0.014D2.5/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    chemistrySolver   Euler2Implicit;
    chemistryThermo   rho2;
}

chemistry           on;

initialChemicalTimeStep 1.0e-9;

modifiedTemperature on;
modifiedTemperatureCoeffs
{
    Tmin      140.0;
    epsilon   80.0;
}


chemistryVibrationCoupling
{
    model ParkTTv;
    
    ParkTTvCoeffs
    {
        exponentTtr         0.7;//- Tp = Ttr^alphap*Tve^(1-alphap)
        sourceTermModel     preferential;
        
        preferentialModel
        {
            factorType      constant;
            constantFactor  0.3;
            
            lineFittedCoeffs // Holman and Boyd (2011)
            {
                vibFactor
                {
                    N2          (5.772e-6 0.162);
                    O2          (1.136e-5 0.166);
                    NO          (9.582e-5 0.190);
                }    
            }    
        }
    } 
    
    CVDVCoeffs
    {
        reciprocalU     3;
        simpleHarmonicOscillatorVibCutOff
        {
            N2   34;
            O2   27;
            NO   28;
            N2+  34;
            O2+  27;
            NO+  28;
        }
    }
}

Euler2ImplicitCoeffs
{
    cTauChem        1.0;
    equilibriumRateLimiter off;
}

// ************************************************************************* //
