tutorials/TC3ForeBody_TwoPhase_theta0.014D2.5/constant/spcProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      particleProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

UreduceD      true;
PreduceD      false;

solution
{
    active          true;
    coupled         true;
    transient       yes;
    cellValueSourceCorrection on;//- correct cell
    smoothTheta     true;
    smoothSourceTerms true;
    useGasFilter      true;
    useGasFilterImplicit    false;
    
    interpolationSchemes
    {
	UFilter			cellPoint;
	rhoFilter       cell;//cellPoint;
	muFilter        cell;//cellPoint;
	TtrFilter        cellPoint;
	CpFilter        cell;//cellPoint;
	kappaFilter        cell;//cellPoint;
	MaFilter        cellPoint;
	gammaFilter        cell;//cellPoint;
	omegaFilter        cell;//cellPoint;
    }

    integrationSchemes
    {
        U               Euler;
        T               Euler;
    }

    sourceTerms
    {
        schemes
        {
            U              explicit 1;
            e              explicit 1;
        }
    }

}

// Particle species
typeIdList                      (ball);
//- with hard sphere
constantProperties
{
    ball
    {
        rho0            2940;//- particle density
        d0              2.5e-06;
        T0              140;
        Cp0             1000;
        K0              0;
        
        epsilon0         0;
        f0               0;
    }
    thetaMax       0.6;//- required in the solver
}

//- options:
//- 0: no particle-particle interaction model
//- 1: empty
//- 2: Multiphase particle-in-cell(MPPIC) method
interiorInteractionType 0;
nEquivalentParticles    1;

coordinateSystemType    particleAxisymmetric;//particleCartesian;//
axisymmetricProperties
{
    radialWeightingMethod    cell;
    revolutionAxis           x;
    polarAxis                y;
    maxRadialWeightingFactor  2;
}
timeStepModel          constantTimeStepModel;

subModels
{
    Forces
    {
    	HendersonDrag
    	{};
    }

    // heatTransferModel none;
    heatTransferModel Kavanau;
    heatTransferModelProperties
    {
        BirdCorrection   false;
    };

    radiation off;
}

diffusionBasedSmoothingProperties
{
	smoothDirection     (1.0 0 0 0 1.0 0 0 0 1.0);
    diffusionBandWidth    0.0000375;// should be 12 to 18 particle diameter
    diffusionSteps        6;//- determine the end time, which is diffusion timestep/steps
}

diffusionBasedGasFilteringProperties
{
	smoothDirection     (1.0 0 0 0 1.0 0 0 0 1.0);
    diffusionBandWidth    0.0000375;// should be 12 to 18 particle diameter
    diffusionSteps        6;//- determine the end time, which is diffusion timestep/steps
}

//-MPPIC
DampingModel   none;
PackingModel   none;
IsotropyModel  none;

cloudFunctions
{}


// ************************************************************************* //
