tutorials/TC3ForeBody_TwoPhase_theta0.014D2.5/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRho2Thermo;
    mixture         reacting2Mixture;
    transport       BlottnerEucken;//powerLawEucken;
    thermo          decoupledEnergyModes;
    energy          sensible2InternalEnergy;
    equationOfState perfect2Gas;
    specie          advancedSpecie;
}

hyLight yes;

downgradeToSingleTv yes;
downgradeToSingleTemperature no;
//constantSigma yes;

chemistryReader foam2ChemistryReader;

//foamChemistryFile "$FOAM_CASE/constant/hTCReactionsEarth93";
foamChemistryFile "$FOAM_CASE/constant/hTCReactionsMars2003";

foamChemistryThermoFile "$FOAM_CASE/constant/thermoDEM";

//transportPropertiesFile "$FOAM_CASE/constant/transportProperties";

twoTemperatureDictFile "$FOAM_CASE/constant/thermo2TModel";

mhdDictFile "$FOAM_CASE/constant/mhdProperties";

temperatureBounds
{
    Tlow    100;
    Thigh   100000;
}

// ************************************************************************* //
