tutorials/TC3ForeBody_TwoPhase_theta0.014D2.5/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ($velocityInlet 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ($velocityInlet 0 0);
    }
    
    object
    {
/*        type            nonEqMaxwellSlipU;*/
/*        accommodationCoeff 1;*/
/*        Uwall           $velocityWall;*/
/*        refValue        uniform $velocityWall;*/
/*        valueFraction   uniform 1.0;*/
/*        thermalCreep    false;*/
/*        curvature       false;*/
/*        value           uniform $velocityWall;*/
	//type fixedValue;
	//value uniform (0 0 0);
	type            noSlip;
    }
    
    frontAndBack_pos
    {
	type		wedge;
    }

    frontAndBack_neg
    {
        type		wedge;
    }

    outlet
    {
	type            zeroGradient;
    }
}

// ************************************************************************* //
