tutorials/TC3ForeBody_TwoPhase_theta0.014D2.5/0/Tt
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Tt;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/initialConditions"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Ttr;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $Ttr;
    }
    
    object
    {
        /*type            nonEqSmoluchowskiJumpT;
        accommodationCoeff 1;
        Twall           uniform 1500;*/
        type            fixedValue;
        value           uniform 1500;
        //type            zeroGradient;
    }
    
    #include "include/boundaries"
}

// ************************************************************************* //
