tutorials/TC3ForeBody_TwoPhase_theta0.014D2.5/0/Tv_O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Tv_O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/initialConditions"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Ttr;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $Ttr;
    }
    
    object
    {
        //type            zeroGradient;
        type            fixedValue;
        value           uniform 1500;
    }
    
    #include "include/boundaries"
}

// ************************************************************************* //
