tutorials/TC3ForeBody_TwoPhase_theta0.014D2.5/0/include/boundaries
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

frontAndBack_pos
{
    type		wedge;
}

frontAndBack_neg
{
	  type		wedge;
}

outlet
{
    type		zeroGradient;
}
