tutorials/TC3ForeBody_TwoPhase_theta0.014D2.5/0/pointPriority
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       labelList;
    location    "2e-10";
    object      pointPriority;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

32302{-2147483648}

// ************************************************************************* //
