tutorials/TC3ForeBody_TwoPhase_theta0.014D2.5/system/diffisionControlDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          diffisionControlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     hybridFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1e-08;

deltaT          1e-08;

writeControl    runTime;

writeInterval   0.1;//- bigger than endTime in controlDict will give a clean result

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression uncompressed;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

}


// ************************************************************************* //
