tutorials/TC3ForeBody_TwoPhase_theta0.014D2.5/system/solidBoundariesDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      solidBoundariesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidPatchBoundaries
(

    boundary
    {
         patchBoundaryProperties
         {
            patch                           object;
         }
         boundaryModel         noSlipTsirkunovWallPatch;
         noSlipTsirkunovWallPatchProperties
         {
/*            wallYoungModulus      7e10;//70GPa*/
/*            wallShearModulus      2.6e10;//26GPa*/
/*            wallMaterialDensity   2700;*/
/*            wallYieldPoint        9.5e7;//20MPa*/

/*            particleYoungModulus    6.6e10;*/
/*            particleShearModulus    3.1e10;//31GPa*/
/*            particleYieldPoint      4.6e9;*/
         }
 
         // boundaryModel   semiEmpiricalReboundWallPatch;
         // semiEmpiricalReboundWallPatchProperties
         // {}
    }

    boundary
    {
         patchBoundaryProperties
         {
            patch                           inlet;
         }
 
         boundaryModel   deletionPatch;
         deletionPatchProperties
         {
            allParticleTypes        yes;
         }
    }

    boundary
    {
         patchBoundaryProperties
         {
            patch                           outlet;
         }
 
         boundaryModel   deletionPatch;
         deletionPatchProperties
         {
            allParticleTypes        yes;
         }
    }
);

//- Two examples of general boundaries have presented here.
solidGeneralBoundaries
(
    boundary
    {
         generalBoundaryProperties
         {
             patch                inlet;
         }

        boundaryModel   solidMassLoadingRatioInflowPatch;

        solidMassLoadingRatioInflowPatchProperties
        {
            typeIds          (ball);
            massLoadingRatio (0.00014);//0.014%
        }
    }
);

solidCyclicBoundaries
(

);
// ************************************************************************* //
