tutorials/TC3ForeBody_TwoPhase_theta0.014D2.5/system/solidFieldPropertiesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      solidFieldPropertiesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidFields
(
/*     field*/
/*     {*/
/*         fieldModel            dsmcVolFields;*/
/* */
/*         timeProperties*/
/*         {*/
/*             timeOption          write;*/
/*             resetAtOutput       off;*/
/*         }*/
/* */
/*         dsmcVolFieldsProperties*/
/*         {*/
/*             fieldName               N2;*/
/*             typeIds                 (N2);*/
/*             measureMeanFreePath         true;*/
/*             averagingAcrossManyRuns    false;*/
/*         }*/
/*     }*/

/*     field*/
/*     {*/
/*         fieldModel            dsmcVolFields;*/
/* */
/*         timeProperties*/
/*         {*/
/*             timeOption      write;*/
/*             resetAtOutput       off;*/
/*         }*/
/* */
/*         dsmcVolFieldsProperties*/
/*         {*/
/*             fieldName               O2;*/
/*             typeIds                 (O2);*/
/*             measureMeanFreePath         true;*/
/*             averagingAcrossManyRuns    false;*/
/*         }*/
/*     }*/

     
     field
     {
         fieldModel            solidVolFields;
 
         timeProperties
         {
             timeOption      write;
             resetAtOutput       on;
         }
 
         solidVolFieldsProperties
         {
             fieldName               mixture;
             typeIds                 (ball);
             averagingAcrossManyRuns    false;
         }
     }
);

// ************************************************************************* //
