tutorials/TC3ForeBody_TwoPhase_theta0.014D2.5/system/surfaceCoefficients
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceCoefficients;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

functions
{
    StantonNumber
    {
        type            StantonNo;
        //- see constant/transportProperties/transportModels: writeWallHeatFlux
        wallHeatFlux    "wallHeatFlux"; 
        libs            ("libstrathFieldFunctionObjects.so");
        writeControl    outputTime;
        log             no;
    }

    frictionCoefficient
    {
        type            frictionCoefficient;
        libs            ("libstrathFieldFunctionObjects.so");
        writeControl    outputTime;
        log             no;
    }

    pressureCoefficient
    {
        type            pressureCoefficient;
        libs            ("libstrathFieldFunctionObjects.so");
        writeControl    outputTime;
        log             no;
    }
}

