tutorials/TC3ForeBody_TwoPhase_theta0.014D2.5/system/surfaceQuantities
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceQuantities;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

wallShearStress
{
    type            wallShearStress;
    libs            ("libstrathFieldFunctionObjects.so");
    patches         ("object");
    writeControl    outputTime;
    log             no;
}


