tutorials/TC3ForeBody_TwoPhase_theta0.014D2.5/system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfaces;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceSampling
{
    type            surfaces;
    functionObjectLibs ("libsampling.so");

    writeControl    writeTime;
    
	  interpolationScheme cellPoint;
	  surfaceFormat raw;
    
    fields 
    (
       U
       p
       wallHeatFlux
    );

    surfaces
    ( 
        object
        {
	          type patch;
	          patches (object);
	          interpolate true;
        }
    );
}
